4.	In the recruitment domain, HR faces the challenge of predicting if the candidate is faking their salary or not. For example, a candidate claims to have 5 years of experience and earns 70,000 per month working as a regional manager. The candidate expects more money than his previous CTC. We need a way to verify their claims (is 70,000 a month working as a regional manager with an experience of 5 years a genuine claim or does he/she make less than that?) Build a Decision Tree and Random Forest model with monthly income as the target variable.

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("C:/2-Dataset/HR_DT.csv.xls")
df

,Position of the employee,no of Years of Experience of employee,monthly income of employee
0,Business Analyst,1.1,39343
1,Junior Consultant,1.3,46205
2,Senior Consultant,1.5,37731
3,Manager,2.0,43525
4,Country Manager,2.2,39891
...,...,...,...
191,Region Manager,3.9,55794
192,Partner,4.0,56957
193,Senior Partner,4.0,57081
194,C-level,4.1,61111
195,CEO,4.5,67938

In [5]:
df.columns

Index(['Position of the employee', 'no of Years of Experience of employee',
       ' monthly income of employee'],
      dtype='object')

In [6]:
# df.columns = [str(col).strip for col in df.columns]
df.rename(columns={' monthly income of employee':"monthly income of employee"}, inplace=True)

In [7]:
df.columns

Index(['Position of the employee', 'no of Years of Experience of employee',
       'monthly income of employee'],
      dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 196 entries, 0 to 195
Data columns (total 3 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   Position of the employee               196 non-null    object
 1   no of Years of Experience of employee  196 non-null    float64
 2   monthly income of employee             196 non-null    int64
dtypes: float64(1), int64(1), object(1)
memory usage: 4.7+ KB

In [9]:
input = df.drop('monthly income of employee', axis = "columns")
target = df['monthly income of employee']

In [10]:
input

    Position of the employee  no of Years of Experience of employee
0           Business Analyst                                    1.1
1          Junior Consultant                                    1.3
2          Senior Consultant                                    1.5
3                    Manager                                    2.0
4            Country Manager                                    2.2
..                       ...                                    ...
191           Region Manager                                    3.9
192                  Partner                                    4.0
193           Senior Partner                                    4.0
194                  C-level                                    4.1
195                      CEO                                    4.5

[196 rows x 2 columns]

In [11]:
target

0      39343
1      46205
2      37731
3      43525
4      39891
       ...
191    55794
192    56957
193    57081
194    61111
195    67938
Name: monthly income of employee, Length: 196, dtype: int64

In [12]:
from sklearn.preprocessing import LabelEncoder

In [13]:
position = LabelEncoder()
experience = LabelEncoder()

In [14]:
input['position'] = position.fit_transform(df['Position of the employee'])
input['experience'] =  experience.fit_transform(df['no of Years of Experience of employee'])

In [15]:
input

,Position of the employee,no of Years of Experience of employee,position,experience
0,Business Analyst,1.1,0,1
1,Junior Consultant,1.3,4,2
2,Senior Consultant,1.5,8,3
3,Manager,2.0,5,4
4,Country Manager,2.2,3,5
...,...,...,...,...
191,Region Manager,3.9,7,10
192,Partner,4.0,6,11
193,Senior Partner,4.0,9,11
194,C-level,4.1,1,12
195,CEO,4.5,2,13

In [16]:
input.drop(['Position of the employee', 'no of Years of Experience of employee'], axis = 'columns')

     position  experience
0           0           1
1           4           2
2           8           3
3           5           4
4           3           5
..        ...         ...
191         7          10
192         6          11
193         9          11
194         1          12
195         2          13

[196 rows x 2 columns]